lvx/base/Documents/бит_НазначениеСоответствияАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_НазначениеСоответствияАналитик</Name>
			<BasedOn>
				<xr:Item>Catalog.бит_ВидыСоответствийАналитик</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СоответствияАналитик</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСоответствия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыСоответствийАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокАналитик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛеваяАналитика_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛеваяАналитика_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛеваяАналитика_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПраваяАналитика_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПраваяАналитика_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПраваяАналитика_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Enums/бит_ВидыСоотношенийАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыСоотношенийАналитик</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОдинКОдному</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинКоМногим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногиеКОдному</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногиеКоМногим</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Documents/бит_НазначениеСоответствияАналитик/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		бит_ОбщегоНазначения.ЗаполнитьПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.бит_ВидыСоответствийАналитик") Тогда	
		ВидСоответствия = ДанныеЗаполнения;
	КонецЕсли;
	
	Дата 		  = ТекущаяДатаСеанса();
	ДатаНачала    = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект, Ложь);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыПроведения = Документы.бит_НазначениеСоответствияАналитик.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
									
	Документы.бит_НазначениеСоответствияАналитик.ПроверитьУникальностьЗаписей(
		ПараметрыПроведения.ТаблицаКонтрольУникальностиЗаписей, 
		ПараметрыПроведения.ТаблицаРеквизиты, Отказ);
												
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	Документы.бит_НазначениеСоответствияАналитик.СформироватьДвиженияСоответствиеАналитик(
		ПараметрыПроведения.ТаблицаСоответствияАналитик,
		ПараметрыПроведения.ТаблицаРеквизиты, Движения, Отказ);
												
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ); 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ); 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьВидСоотношенияАналитик(Отказ);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата 		  = ТекущаяДатаСеанса();
	ДатаНачала    = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	
	РучнаяКорректировка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ПроверяемыеРеквизиты.Добавить("СписокАналитик.ДатаНачала");	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОкончания) И ДатаНачала > ДатаОкончания Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "Корректность", НСтр("ru = 'Дата начала'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ДатаНачала", "Объект", Отказ); 
	КонецЕсли;
	
	Таблица = СписокАналитик.Выгрузить();
	Для каждого СтрокаТаблицы Из Таблица Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаНачала) Тогда
			СтрокаТаблицы.ДатаНачала = ДатаНачала;		
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) Тогда
			СтрокаТаблицы.ДатаОкончания = ?(ЗначениеЗаполнено(ДатаОкончания), ДатаОкончания, '20361231');		
		КонецЕсли;
	КонецЦикла; 

	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Поле = "СписокАналитик[%1].ДатаНачала";
		Поле = СтрШаблон(Поле, Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ="));

		Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаНачала)
		   И ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) 
		   И СтрокаТаблицы.ДатаНачала > СтрокаТаблицы.ДатаОкончания Тогда
		   
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
								"КОЛОНКА", "КОРРЕКТНОСТЬ", НСтр("ru = 'Дата начала'"), СтрокаТаблицы.НомерСтроки,
								НСтр("ru = 'Соответствия'"));
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, "Объект", Отказ); 
		КонецЕсли;
	КонецЦикла; 
		
	ПроверитьПересечениеПериодов(Таблица, Отказ);

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьВидСоотношенияАналитик(Отказ)

	ВидСоотношения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидСоответствия, "Соотношение");
	Если ВидСоотношения = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКоМногим Тогда
		Пояснение = НСтр("ru = 'Соотношение ""Многие ко многим не поддерживается.'"); 
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", 
							"Корректность", НСтр("ru = 'Вид соответствия'"),,, Пояснение);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ВидСоответствия", "Объект", Отказ); 
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПересечениеПериодов(Таблица, Отказ)
	
	Если НЕ ЗначениеЗаполнено(ВидСоответствия) Тогда
		Возврат;
	КонецЕсли;

	Соотношение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидСоответствия, "Соотношение");
	
	Если Соотношение <> Перечисления.бит_ВидыСоотношенийАналитик.ОдинКОдному Тогда
		Возврат;
	КонецЕсли;
				 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДокумента", Таблица); 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокАналитик.НомерСтроки КАК НомерСтроки,
	|	СписокАналитик.ЛеваяАналитика_1 КАК ЛеваяАналитика_1,
	|	СписокАналитик.ЛеваяАналитика_2 КАК ЛеваяАналитика_2,
	|	СписокАналитик.ЛеваяАналитика_3 КАК ЛеваяАналитика_3,
	|	СписокАналитик.ПраваяАналитика_1 КАК ПраваяАналитика_1,
	|	СписокАналитик.ПраваяАналитика_2 КАК ПраваяАналитика_2,
	|	СписокАналитик.ПраваяАналитика_3 КАК ПраваяАналитика_3,
	|	СписокАналитик.ДатаНачала КАК ДатаНачала,
	|	СписокАналитик.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК СписокАналитик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОдинКОдному.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокумента.НомерСтроки КАК КонфликтующийНомерСтроки
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ОдинКОдному
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ПО ВТ_ОдинКОдному.ЛеваяАналитика_1 = ВТ_ТаблицаДокумента.ЛеваяАналитика_1
	|			И ВТ_ОдинКОдному.ЛеваяАналитика_2 = ВТ_ТаблицаДокумента.ЛеваяАналитика_2
	|			И ВТ_ОдинКОдному.ЛеваяАналитика_3 = ВТ_ТаблицаДокумента.ЛеваяАналитика_3
	|			И ВТ_ОдинКОдному.ПраваяАналитика_1 = ВТ_ТаблицаДокумента.ПраваяАналитика_1
	|			И ВТ_ОдинКОдному.ПраваяАналитика_2 = ВТ_ТаблицаДокумента.ПраваяАналитика_2
	|			И ВТ_ОдинКОдному.ПраваяАналитика_3 = ВТ_ТаблицаДокумента.ПраваяАналитика_3
	|			И (ВТ_ОдинКОдному.ДатаНачала > ВТ_ТаблицаДокумента.ДатаНачала
	|					И ВТ_ОдинКОдному.ДатаНачала <= ВТ_ТаблицаДокумента.ДатаОкончания
	|				ИЛИ ВТ_ОдинКОдному.ДатаОкончания >= ВТ_ТаблицаДокумента.ДатаНачала
	|					И ВТ_ОдинКОдному.ДатаОкончания < ВТ_ТаблицаДокумента.ДатаОкончания
	|				ИЛИ ВТ_ТаблицаДокумента.ДатаНачала > ВТ_ОдинКОдному.ДатаНачала
	|					И ВТ_ТаблицаДокумента.ДатаНачала <= ВТ_ОдинКОдному.ДатаОкончания
	|				ИЛИ ВТ_ТаблицаДокумента.ДатаОкончания >= ВТ_ОдинКОдному.ДатаНачала
	|					И ВТ_ТаблицаДокумента.ДатаОкончания < ВТ_ОдинКОдному.ДатаОкончания)";
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Поле = "СписокАналитик[%1].НомерСтроки";
		Поле = СтрШаблон(Поле, Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ="));
		
		ТекстСообщения = НСтр("ru = 'Некорректно заполнена строка ""%1"" списка ""%2"". Такая запись с пересекающимся периодом уже существует. См. строку ""%3"".'");	
		ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.НомерСтроки, 
							НСтр("ru = 'Соответствия'"), Выборка.КонфликтующийНомерСтроки);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			ЭтотОбъект, Поле, "Объект", Отказ);
			
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
